<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Default upload mode
    |--------------------------------------------------------------------------
    */

    'default' => 'qcos',

    /*
    |--------------------------------------------------------------------------
    | upload mode
    |--------------------------------------------------------------------------
    */

    'mode' => [

        'avatar' => [               // 用户头像上传
            'driver' => 'avatar',
            'type' => 'square',         // 正方形
            'aspect' => array(
                'big' => 400,
                'normal' => 200         // normal 默认图片
            )
        ],

        'topics' => [               // 主题上传
            'driver' => 'topics',
            'type' => 'widen',      // 最大宽度 缩放
            'aspect' => array(
                'normal' => 1440
            )
        ],

        'custom' => [
            'driver' => 'custom',
            'type' => 'image'
        ],
        
        'file' => [
            'driver' => 'custom',
            'type' => 'image'
        ],
    ],

];
